# Return random praise.
praise <- function() {
  swirl_is_fun <- getOption("swirl_is_fun")
  
  if(is.null(swirl_is_fun) || isTRUE(swirl_is_fun)) {
    phrases <- c(s()%N%"اجابه صحيحه ممتاز",
                 s()%N%"احسنت",
                 s()%N%"استمر عملك ممتاز",
                 s()%N%"ماشاء الله عليك ",
                 s()%N%"الى الامام يا صديقي",
                 s()%N%"مبدع",
                 s()%N%"احسنت ياذكي",
                 s()%N%"مااروع تميزك",
                 s()%N%"كم انت مبدع",
                 s()%N%"اجابه رائعه",
                 s()%N%"عمل عظيم يااخي",
                 s()%N%"متميز كالعاده",
                 s()%N%"عمل متقن ياطالب العلم",
                 s()%N%"اجابه صحيحه",
                 s()%N%"اجابه موفقه",
                 s()%N%"رزقك الله الجنه",
                 s()%N%"احسنت مع الشكر",
                 s()%N%"ممتاز استمر بهذه الجهود المثمره",
                 s()%N%"ممتاز استمر في العطاء",
                 s()%N%"كم انت مبدع ",
                 s()%N%"اهنئك اجابتك بغايه الروعه ")
  } else {
    phrases <- s()%N%"Correct!"
  }
  sample(phrases, 1)
}

# Return random "try again" message.
tryAgain <- function() {
  swirl_is_fun <- getOption("swirl_is_fun")
  
  if(is.null(swirl_is_fun) || isTRUE(swirl_is_fun)) {
    phrases <- c(s()%N%"تقريبا ولكن حاول مره اخرى",
                 s()%N%"اقتربت من الاجابه ،حاول مره اخرى",
                 s()%N%"صديقي حاول مره اخرى",
                 s()%N%"حاول مره اخرى يابطل",
                 s()%N%"صديقي حاول مره اخرى",
                 s()%N%"ليست الاجابه التي ابحث عنها حاول مره اخرى",
                 s()%N%"محاوله جميله ، ولكن ليست صحيحه ،حاول مره اخرى",
                 s()%N%"استمر في المحاوله",
                 s()%N%"صديقي حاول مره ثانيه",
                 s()%N%"اقتربت من الاجابه ،استمر في المحاوله",
                 s()%N%"انا اشعر بانك تقترب من الاجابه الصحيحه استمر في المحاوله ياعزيزي",
                 s()%N%"حاول مره ثانيه يا اذكى طالب",
                 s()%N%"ليست اجابه صحيحه ولكن استمر  وفقك الله",
                 s()%N%"حاول مره اخرى ، جدا مزعج الحصول على الاجابه الصحيحه من اول محاوله")
  } else {
    phrases <- s()%N%"غير صحيحه ولكن حاول سوف تصل الى الاجابه قريبا "
  }
  sample(phrases, 1)
}
